package com.testtask.shop.facade;

import com.testtask.shop.shop.Shop;
import com.testtask.shop.shop.impl.ShopImpl;

import java.io.IOException;

/**
 * Created by Павло on 23.09.2017.
 */
public class AppFacade {
    public static void main(String[] args) throws IOException {
        Shop shop = new ShopImpl();
        shop.beginWork();
    }
}

/*

"Вода минеральная Хорошо", 9.99, "минеральные воды", 0.3, "вода минеральная, лечебно-столовая", 570
"Вода минеральная Хорошо", 15.47, "минеральные воды", 1.5, "вода минеральная, лечебно-столовая", 412
"Пиво Одесское Новое", 13.25, "пиво", 0.5, 4.3%, 120
"Красная испанка", 80.00, "вино", 0.75, 14%, 92
"Сок Богач Грейпфрутовый", 22.00, "соки", 0.95, "вода, сок грейпфрутовый концентрированный, фруктоза, лимонная кислота", 156
"Енерджи бум Плюс", 24.15, "прочие напитки", 0.33, "вода, лимонная кислота, ароматизатор Яблоко, Е-345, Е-120, Е-630, Е-632, краситель Вишня", 78
"Мартини Биссе", 205.00, "ликеры", 1.0, 13%, 12
"Два моря", 195.00, "вино", 0.75, 12%, 0

* */